In [27]:
import pandas as pd
df = pd.read_csv("animals.csv", parse_dates = ["Timestamp"])
#df = pd.DataFrame({'Animal' : ['Falcon', 'Falcon', 'Parrot', 'Parrot'], 'Max Speed' : [380.0, 370.0,24.0, 26.0]})
#df = pd.DataFrame works
grouped_df = df.groupby(['Animal']).mean()
grouped_df

        Max Speed                        Timestamp
Animal
Falcon      375.0        2021-04-02 05:49:13+00:00
Parrot       25.0 2021-04-02 04:22:13.500000+00:00

In [28]:
df

   Animal  Max Speed                 Timestamp
0  Falcon      380.0 2021-04-02 06:25:52+00:00
1  Falcon      370.0 2021-04-02 05:12:34+00:00
2  Parrot       24.0 2021-04-02 05:11:03+00:00
3  Parrot       26.0 2021-04-02 03:33:24+00:00

In [29]:
type(df)

pandas.core.frame.DataFrame

In [31]:
#df2 = df.drop("Timestamp")
#df2   #Does not work

df2 = df.drop("Timestamp", axis=1)
df2

#df2 = df.drop("Timestamp", inplace=True, axis=1)
#df2 #Do not use - causes error

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [32]:
df2

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [33]:
df

   Animal  Max Speed                 Timestamp
0  Falcon      380.0 2021-04-02 06:25:52+00:00
1  Falcon      370.0 2021-04-02 05:12:34+00:00
2  Parrot       24.0 2021-04-02 05:11:03+00:00
3  Parrot       26.0 2021-04-02 03:33:24+00:00